////********************************************************************//
////第一层结构，从排样结果的dxf中读取数据的数据结构，经过排样后，
////只有LINE,ARC,CIRCLE这三种数据结构了，多段线转为了LINE
////********************************************************************//
//typedef struct
//{
//	double x0, y0, x1, y1;//直线的起止点
//	int flag;//作为直线是否已经被系统收录进入封闭体的标志
//}LINE;//读取排样dxf结果时候的直线数据存储结构
//typedef struct
//{
//	double Arccent_x, Arccent_y;//ARC的圆心
//	double r;//ARC的半径
//	double angle_start,angle_end;//ARC的起止角度
//	double x0, y0, x1, y1;//作为ARC的起点和终点,要找到上面五个参数与下面四个参数之间的关系
//	int flag;
//}ARC;
//typedef struct
//{
//	double Circent_x, Circent_y;//CIRCLE的圆心
//	double R;//CIRCLE的半径
//	int flag;
//}CIRCLE;
//********************************************************************//
//第二层结构，要对上面的三种数据结构建立统一标准的ID,用来后续遍历所有图元用
//这应该是一个统一的数据结构类型，包含了LINE,ARC,CIRCLE上面的三种数据类型
//********************************************************************//
//typedef struct//读取数据时，这里才是整个数据的入口,
//{
//	LINE line;
//	ARC arc;
//	CIRCLE circle;
//	double x0, y0, x1, y1;//用来后面整体遍历时候用的判断数据，这个数据LINE是直接输入，ARC是转换输入，CIRCLE是输入999999
//	bool flag;//作为后面寻找封闭环时候，该图元时候已经被识别的标志。
//	int ID;//后面遍历使用时候的标志。每一个ID代表一个独立的图元前面的都不需要ID
//}GEOMELE;//几何图元
//class GEOMELE
//{
//public:
//	GEOMELE();
//	~GEOMELE();
//	//将dxf里面的图元数据读进来
//public:
//	LINE line;
//	ARC arc;
//	CIRCLE circle;
//
//private:
//
//};

//GEOMELE::GEOMELE()
//{
//}
//
//GEOMELE::~GEOMELE()
//{
//}
////********************************************************************//
////第三层结构，要对几何图元进行遍历，按照x0, y0, x1, y1的关系来找到封闭环，每个封闭环用IID来区分
////封闭环里面的图元应该是有序的排列，并选择其中一个套图元作为封闭环的起点
////在这里之后已经没有LINE ARC CIRCLE这样的图元了，有的是一个个封闭环。
////********************************************************************//
//typedef struct
//{
//	double x0, y0, x1, y1;//作为每个封闭环的起始点
//	int IID;//作为封闭环的标志，在最后用这一个个封闭图元去切割时候遍历用的
//	bool flag;//如果不选择最近的路径点，而是全局最优的时候采用
//}GEOMCLOSE;
////********************************************************************//
////辅助线段在封闭图元与封闭图元之间过渡
////********************************************************************//
//typedef struct
//{
//	double x0, y0, x1, y1;//每根空行程过渡线段的起止点
//	int No;//线段的标记，与上面的GEOMCLOSE之间对应。
//}TRALINE;